src/main/java/ru/vk/itmo/test/abramovilya/wrk/results/stage2/t4_c20_R22000.txt
Running 1m test @ http://localhost:8080
  4 threads and 20 connections
  Thread calibration: mean lat.: 1.131ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.126ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.131ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.132ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.14ms  549.89us   8.22ms   65.80%
    Req/Sec     5.80k   367.68     9.11k    70.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.11ms
 75.000%    1.51ms
 90.000%    1.89ms
 99.000%    2.43ms
 99.900%    2.97ms
 99.990%    5.43ms
 99.999%    7.46ms
100.000%    8.23ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.049     0.000000            1         1.00
       0.420     0.100000       110007         1.11
       0.642     0.200000       220365         1.25
       0.808     0.300000       330049         1.43
       0.966     0.400000       439790         1.67
       1.114     0.500000       550412         2.00
       1.182     0.550000       605409         2.22
       1.249     0.600000       659979         2.50
       1.324     0.650000       715248         2.86
       1.409     0.700000       769943         3.33
       1.509     0.750000       825060         4.00
       1.564     0.775000       852447         4.44
       1.621     0.800000       879584         5.00
       1.680     0.825000       907087         5.71
       1.744     0.850000       934714         6.67
       1.815     0.875000       962317         8.00
       1.852     0.887500       975988         8.89
       1.891     0.900000       989802        10.00
       1.931     0.912500      1003267        11.43
       1.975     0.925000      1017257        13.33
       2.023     0.937500      1030992        16.00
       2.051     0.943750      1038101        17.78
       2.079     0.950000      1044849        20.00
       2.109     0.956250      1051470        22.86
       2.145     0.962500      1058458        26.67
       2.185     0.968750      1065156        32.00
       2.209     0.971875      1068670        35.56
       2.235     0.975000      1072144        40.00
       2.263     0.978125      1075580        45.71
       2.295     0.981250      1078884        53.33
       2.335     0.984375      1082436        64.00
       2.357     0.985938      1084104        71.11
       2.381     0.987500      1085713        80.00
       2.409     0.989062      1087489        91.43
       2.441     0.990625      1089207       106.67
       2.481     0.992188      1090905       128.00
       2.503     0.992969      1091731       142.22
       2.529     0.993750      1092605       160.00
       2.559     0.994531      1093478       182.86
       2.593     0.995313      1094301       213.33
       2.639     0.996094      1095172       256.00
       2.663     0.996484      1095583       284.44
       2.695     0.996875      1096024       320.00
       2.727     0.997266      1096444       365.71
       2.767     0.997656      1096874       426.67
       2.809     0.998047      1097314       512.00
       2.833     0.998242      1097527       568.89
       2.863     0.998437      1097740       640.00
       2.897     0.998633      1097948       731.43
       2.937     0.998828      1098170       853.33
       2.977     0.999023      1098382      1024.00
       3.003     0.999121      1098487      1137.78
       3.029     0.999219      1098598      1280.00
       3.063     0.999316      1098698      1462.86
       3.097     0.999414      1098804      1706.67
       3.149     0.999512      1098916      2048.00
       3.169     0.999561      1098967      2275.56
       3.201     0.999609      1099021      2560.00
       3.243     0.999658      1099073      2925.71
       3.305     0.999707      1099126      3413.33
       3.415     0.999756      1099181      4096.00
       3.491     0.999780      1099207      4551.11
       3.667     0.999805      1099235      5120.00
       3.953     0.999829      1099261      5851.43
       4.359     0.999854      1099289      6826.67
       4.791     0.999878      1099314      8192.00
       5.015     0.999890      1099328      9102.22
       5.487     0.999902      1099341     10240.00
       5.731     0.999915      1099355     11702.86
       5.991     0.999927      1099369     13653.33
       6.251     0.999939      1099381     16384.00
       6.335     0.999945      1099388     18204.44
       6.563     0.999951      1099395     20480.00
       6.675     0.999957      1099402     23405.71
       6.807     0.999963      1099408     27306.67
       6.955     0.999969      1099415     32768.00
       7.027     0.999973      1099418     36408.89
       7.087     0.999976      1099422     40960.00
       7.199     0.999979      1099425     46811.43
       7.287     0.999982      1099429     54613.33
       7.339     0.999985      1099432     65536.00
       7.367     0.999986      1099434     72817.78
       7.427     0.999988      1099435     81920.00
       7.459     0.999989      1099437     93622.86
       7.499     0.999991      1099440    109226.67
       7.499     0.999992      1099440    131072.00
       7.507     0.999993      1099441    145635.56
       7.683     0.999994      1099442    163840.00
       7.771     0.999995      1099443    187245.71
       7.771     0.999995      1099443    218453.33
       7.791     0.999996      1099444    262144.00
       7.875     0.999997      1099445    291271.11
       7.875     0.999997      1099445    327680.00
       7.919     0.999997      1099446    374491.43
       7.919     0.999998      1099446    436906.67
       7.919     0.999998      1099446    524288.00
       7.951     0.999998      1099447    582542.22
       7.951     0.999998      1099447    655360.00
       7.951     0.999999      1099447    748982.86
       7.951     0.999999      1099447    873813.33
       7.951     0.999999      1099447   1048576.00
       8.231     0.999999      1099448   1165084.44
       8.231     1.000000      1099448          inf
#[Mean    =        1.137, StdDeviation   =        0.550]
#[Max     =        8.224, Total count    =      1099448]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1319767 requests in 1.00m, 84.33MB read
  Non-2xx or 3xx responses: 652
Requests/sec:  21995.89
Transfer/sec:      1.41MB