src/main/java/ru/vk/itmo/test/abramovilya/wrk/results/stage2/t4_c30_R22000_virtual_per_task.txt
Running 2m test @ http://localhost:8080
  4 threads and 30 connections
  Thread calibration: mean lat.: 1.100ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.142ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.106ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.108ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.17ms  532.56us   5.84ms   66.27%
    Req/Sec     5.80k   373.30     7.55k    70.17%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.13ms
 75.000%    1.52ms
 90.000%    1.87ms
 99.000%    2.54ms
 99.900%    2.96ms
 99.990%    3.80ms
 99.999%    5.08ms
100.000%    5.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.062     0.000000            1         1.00
       0.495     0.100000       242901         1.11
       0.671     0.200000       484226         1.25
       0.830     0.300000       726025         1.43
       0.984     0.400000       968439         1.67
       1.133     0.500000      1209679         2.00
       1.208     0.550000      1331455         2.22
       1.282     0.600000      1451809         2.50
       1.358     0.650000      1573587         2.86
       1.437     0.700000      1694626         3.33
       1.521     0.750000      1815040         4.00
       1.566     0.775000      1875241         4.44
       1.615     0.800000      1936254         5.00
       1.667     0.825000      1996539         5.71
       1.725     0.850000      2057006         6.67
       1.791     0.875000      2117510         8.00
       1.828     0.887500      2147336         8.89
       1.869     0.900000      2177349        10.00
       1.916     0.912500      2208112        11.43
       1.969     0.925000      2238297        13.33
       2.031     0.937500      2268230        16.00
       2.067     0.943750      2283669        17.78
       2.107     0.950000      2299020        20.00
       2.149     0.956250      2313794        22.86
       2.197     0.962500      2328752        26.67
       2.251     0.968750      2343742        32.00
       2.283     0.971875      2351638        35.56
       2.315     0.975000      2358855        40.00
       2.353     0.978125      2366643        45.71
       2.393     0.981250      2373996        53.33
       2.441     0.984375      2381675        64.00
       2.467     0.985938      2385425        71.11
       2.493     0.987500      2389031        80.00
       2.525     0.989062      2392836        91.43
       2.561     0.990625      2396731       106.67
       2.599     0.992188      2400405       128.00
       2.619     0.992969      2402246       142.22
       2.643     0.993750      2404181       160.00
       2.669     0.994531      2406077       182.86
       2.699     0.995313      2407969       213.33
       2.733     0.996094      2409847       256.00
       2.751     0.996484      2410743       284.44
       2.771     0.996875      2411698       320.00
       2.795     0.997266      2412661       365.71
       2.821     0.997656      2413590       426.67
       2.851     0.998047      2414531       512.00
       2.869     0.998242      2415044       568.89
       2.887     0.998437      2415497       640.00
       2.909     0.998633      2415991       731.43
       2.933     0.998828      2416437       853.33
       2.961     0.999023      2416885      1024.00
       2.977     0.999121      2417118      1137.78
       2.997     0.999219      2417362      1280.00
       3.019     0.999316      2417610      1462.86
       3.043     0.999414      2417840      1706.67
       3.075     0.999512      2418081      2048.00
       3.095     0.999561      2418184      2275.56
       3.117     0.999609      2418303      2560.00
       3.143     0.999658      2418419      2925.71
       3.181     0.999707      2418537      3413.33
       3.237     0.999756      2418654      4096.00
       3.267     0.999780      2418712      4551.11
       3.331     0.999805      2418772      5120.00
       3.401     0.999829      2418830      5851.43
       3.515     0.999854      2418889      6826.67
       3.641     0.999878      2418951      8192.00
       3.721     0.999890      2418978      9102.22
       3.813     0.999902      2419007     10240.00
       3.899     0.999915      2419037     11702.86
       3.981     0.999927      2419067     13653.33
       4.099     0.999939      2419096     16384.00
       4.171     0.999945      2419111     18204.44
       4.239     0.999951      2419125     20480.00
       4.307     0.999957      2419141     23405.71
       4.411     0.999963      2419155     27306.67
       4.519     0.999969      2419170     32768.00
       4.547     0.999973      2419177     36408.89
       4.619     0.999976      2419184     40960.00
       4.723     0.999979      2419193     46811.43
       4.795     0.999982      2419199     54613.33
       4.903     0.999985      2419207     65536.00
       4.959     0.999986      2419210     72817.78
       4.995     0.999988      2419214     81920.00
       5.079     0.999989      2419219     93622.86
       5.083     0.999991      2419221    109226.67
       5.223     0.999992      2419226    131072.00
       5.231     0.999993      2419227    145635.56
       5.279     0.999994      2419229    163840.00
       5.435     0.999995      2419231    187245.71
       5.459     0.999995      2419232    218453.33
       5.543     0.999996      2419234    262144.00
       5.575     0.999997      2419235    291271.11
       5.599     0.999997      2419236    327680.00
       5.663     0.999997      2419237    374491.43
       5.691     0.999998      2419239    436906.67
       5.691     0.999998      2419239    524288.00
       5.691     0.999998      2419239    582542.22
       5.743     0.999998      2419240    655360.00
       5.743     0.999999      2419240    748982.86
       5.747     0.999999      2419241    873813.33
       5.747     0.999999      2419241   1048576.00
       5.747     0.999999      2419241   1165084.44
       5.783     0.999999      2419242   1310720.00
       5.783     0.999999      2419242   1497965.71
       5.783     0.999999      2419242   1747626.67
       5.783     1.000000      2419242   2097152.00
       5.783     1.000000      2419242   2330168.89
       5.847     1.000000      2419243   2621440.00
       5.847     1.000000      2419243          inf
#[Mean    =        1.166, StdDeviation   =        0.533]
#[Max     =        5.844, Total count    =      2419243]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2639652 requests in 2.00m, 168.66MB read
Requests/sec:  21996.94
Transfer/sec:      1.41MB